---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridlinesOutOfBounds
source: html/1f9d6bc6-5a36-52d8-23b9-f24ed897613f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridlinesOutOfBounds Property

Manually placed curtain grid lines are on the wall edges or outside the wall boundaries.

## Syntax (C#)
```csharp
public static FailureDefinitionId GridlinesOutOfBounds { get; }
```